<a href="https://colab.research.google.com/github/HaseenaB/python-coding/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
x=pd.Series([1,2,3,4])

In [0]:
x

0    1
1    2
2    3
3    4
dtype: int64

In [0]:
x.dtype

dtype('int64')

In [0]:
y=pd.DataFrame({"Name":["Haseena","Thariq","Thabeena","Sarama"],"Age":[27,32,2,23],"City":["Salem","Erode","Salem","Erode"]})

In [0]:
y

   Age   City      Name
0   27  Salem   Haseena
1   32  Erode    Thariq
2    2  Salem  Thabeena
3   23  Erode    Sarama

In [0]:
y["Name"]

0     Haseena
1      Thariq
2    Thabeena
3      Sarama
Name: Name, dtype: object

In [0]:
x[2]

3

In [0]:
z=pd.Series([1,2,3,4,5])

In [0]:
z

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [0]:
z.dtype

dtype('int64')

In [0]:
z.index

RangeIndex(start=0, stop=5, step=1)

In [0]:
z[1:3]

1    2
2    3
dtype: int64

In [0]:
x=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [0]:
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [0]:
y

   Age   City      Name
0   27  Salem   Haseena
1   32  Erode    Thariq
2    2  Salem  Thabeena
3   23  Erode    Sarama

In [0]:
z

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [0]:
a=pd.DataFrame({"Name":["Haseena","Sarama","Shindu","Arjun","Mani","Smani","Thabeena","Thariq","Rose","Jasmine","Lotus","Lilly"],"Age":[22,23,24,25,21,12,2,56,24,32,14,13],"Height":[133,144,122,131,123,124,125,121,134,154,145,143]})

In [0]:
a

    Age  Height      Name
0    22     133   Haseena
1    23     144    Sarama
2    24     122    Shindu
3    25     131     Arjun
4    21     123      Mani
5    12     124     Smani
6     2     125  Thabeena
7    56     121    Thariq
8    24     134      Rose
9    32     154   Jasmine
10   14     145     Lotus
11   13     143     Lilly

In [0]:
a['weight']=a['Age']+a['Height']

In [0]:
a['weight']

0     155
1     167
2     146
3     156
4     144
5     136
6     127
7     177
8     158
9     186
10    159
11    156
Name: weight, dtype: int64

In [0]:
a

    Age  Height      Name  weight
0    22     133   Haseena     155
1    23     144    Sarama     167
2    24     122    Shindu     146
3    25     131     Arjun     156
4    21     123      Mani     144
5    12     124     Smani     136
6     2     125  Thabeena     127
7    56     121    Thariq     177
8    24     134      Rose     158
9    32     154   Jasmine     186
10   14     145     Lotus     159
11   13     143     Lilly     156

In [0]:
a.Age

0     22
1     23
2     24
3     25
4     21
5     12
6      2
7     56
8     24
9     32
10    14
11    13
Name: Age, dtype: int64

In [0]:
a

    Age  Height      Name  weight
0    22     133   Haseena     155
1    23     144    Sarama     167
2    24     122    Shindu     146
3    25     131     Arjun     156
4    21     123      Mani     144
5    12     124     Smani     136
6     2     125  Thabeena     127
7    56     121    Thariq     177
8    24     134      Rose     158
9    32     154   Jasmine     186
10   14     145     Lotus     159
11   13     143     Lilly     156

In [0]:
a

    Age  Height      Name  weight
0    22     133   Haseena     155
1    23     144    Sarama     167
2    24     122    Shindu     146
3    25     131     Arjun     156
4    21     123      Mani     144
5    12     124     Smani     136
6     2     125  Thabeena     127
7    56     121    Thariq     177
8    24     134      Rose     158
9    32     154   Jasmine     186
10   14     145     Lotus     159
11   13     143     Lilly     156

In [0]:
a[["Name","Age","Height","weight"]]

        Name  Age  Height  weight
0    Haseena   22     133     155
1     Sarama   23     144     167
2     Shindu   24     122     146
3      Arjun   25     131     156
4       Mani   21     123     144
5      Smani   12     124     136
6   Thabeena    2     125     127
7     Thariq   56     121     177
8       Rose   24     134     158
9    Jasmine   32     154     186
10     Lotus   14     145     159
11     Lilly   13     143     156